<x-app-layout title="หน้าหลัก">
    <div class="flex flex-col">
        <h3 class="text-2xl mt-3">ยอดสถิติวันลาประจำปี {{ now()->format('Y') }}</h3>
        <x-card-holder-xl4>
            {{-- ลาพักร้อนปัจจุบัน --}}
            <x-stat-card title="ลาพักร้อนปี {{ now()->format('Y') }}" content="{{ $sumleave->cur_vacation }} วัน"
                subcontent="เหลือ {{ $sumleave->remain_cur_vacation }} วัน"
                icon="M1728 1664q26 0 45 19t19 45q0 26-19 45t-45 19H960q-26 0-45-19t-19-45q0-26 19-45t45-19h768zm-128 256q26 0 45 19t19 45q0 26-19 45t-45 19h-512q-26 0-45-19t-19-45q0-26 19-45t45-19h512zm238-512h210v128H537q-10 64-14 128t-7 127t-3 128t-1 129H128v-193q0-81 6-160t17-159H0v-128h172q50-245 151-471t250-427q-146-5-268-61T82 289l-45-46l47-44q104-97 228-147T579 1q156 0 286 58t239 168q77 2 149 24t134 60t113 90t87 115t57 135t20 150v64h-64q-132 0-247-56t-199-159q-76 138-191 227t-269 125q-43 99-76 200t-57 206h289q22-84 69-154t112-122t146-79t167-29q87 0 167 28t145 80t113 121t69 155zM1238 380q-6 65-26 132q51 88 134 146t185 74q-10-61-35-115t-63-101t-88-80t-107-56zm-126 7q-102 8-192 50T759 547T642 704t-61 189q85-7 161-36t139-78t112-112t81-144q14-33 23-67t15-69zM224 247q80 66 177 101t201 35q97 0 187-30t168-88q-80-66-177-101t-201-35q-97 0-187 30t-168 88zm318 775q-8 2-16 2t-16 0h-32q-16 0-32-2v-47q-53 118-89 232t-59 230t-32 235t-10 248h128q0-121 8-234t27-223t49-219t74-222zm442 386h720q-20-57-56-104t-83-81t-104-52t-117-19q-61 0-117 18t-103 52t-84 81t-56 105z"
                foot="ใช้ได้ถึง {{ $duedate->current_duedate->format('d-m-Y') }}" color-sub="text-green-500 bg-green-100"
                color-foot="text-red-500 bg-red-100">
            </x-stat-card>
            {{-- ลาพักร้อนคงเหลือปีก่อน --}}

            @if (today() > $duedate->past_year_duedate)
                <x-stat-card title="ลาพักร้อนปี {{ now()->format('Y') - 1 }}" content="หมดเขตการใช้งาน" subcontent="-"
                    icon="M1728 1664q26 0 45 19t19 45q0 26-19 45t-45 19H960q-26 0-45-19t-19-45q0-26 19-45t45-19h768zm-128 256q26 0 45 19t19 45q0 26-19 45t-45 19h-512q-26 0-45-19t-19-45q0-26 19-45t45-19h512zm238-512h210v128H537q-10 64-14 128t-7 127t-3 128t-1 129H128v-193q0-81 6-160t17-159H0v-128h172q50-245 151-471t250-427q-146-5-268-61T82 289l-45-46l47-44q104-97 228-147T579 1q156 0 286 58t239 168q77 2 149 24t134 60t113 90t87 115t57 135t20 150v64h-64q-132 0-247-56t-199-159q-76 138-191 227t-269 125q-43 99-76 200t-57 206h289q22-84 69-154t112-122t146-79t167-29q87 0 167 28t145 80t113 121t69 155zM1238 380q-6 65-26 132q51 88 134 146t185 74q-10-61-35-115t-63-101t-88-80t-107-56zm-126 7q-102 8-192 50T759 547T642 704t-61 189q85-7 161-36t139-78t112-112t81-144q14-33 23-67t15-69zM224 247q80 66 177 101t201 35q97 0 187-30t168-88q-80-66-177-101t-201-35q-97 0-187 30t-168 88zm318 775q-8 2-16 2t-16 0h-32q-16 0-32-2v-47q-53 118-89 232t-59 230t-32 235t-10 248h128q0-121 8-234t27-223t49-219t74-222zm442 386h720q-20-57-56-104t-83-81t-104-52t-117-19q-61 0-117 18t-103 52t-84 81t-56 105z"
                    foot="หมดเขตการใช้งาน" color-sub="text-red-500 bg-red-100" color-foot="text-red-500 bg-red-100">
                </x-stat-card>
            @else
                <x-stat-card title="ลาพักร้อนปี {{ now()->format('Y') - 1 }}"
                    content="{{ $sumleave->prev_vecation_usage }} วัน"
                    subcontent="เหลือ {{ $sumleave->prev_vecation_remain }} วัน"
                    icon="M1728 1664q26 0 45 19t19 45q0 26-19 45t-45 19H960q-26 0-45-19t-19-45q0-26 19-45t45-19h768zm-128 256q26 0 45 19t19 45q0 26-19 45t-45 19h-512q-26 0-45-19t-19-45q0-26 19-45t45-19h512zm238-512h210v128H537q-10 64-14 128t-7 127t-3 128t-1 129H128v-193q0-81 6-160t17-159H0v-128h172q50-245 151-471t250-427q-146-5-268-61T82 289l-45-46l47-44q104-97 228-147T579 1q156 0 286 58t239 168q77 2 149 24t134 60t113 90t87 115t57 135t20 150v64h-64q-132 0-247-56t-199-159q-76 138-191 227t-269 125q-43 99-76 200t-57 206h289q22-84 69-154t112-122t146-79t167-29q87 0 167 28t145 80t113 121t69 155zM1238 380q-6 65-26 132q51 88 134 146t185 74q-10-61-35-115t-63-101t-88-80t-107-56zm-126 7q-102 8-192 50T759 547T642 704t-61 189q85-7 161-36t139-78t112-112t81-144q14-33 23-67t15-69zM224 247q80 66 177 101t201 35q97 0 187-30t168-88q-80-66-177-101t-201-35q-97 0-187 30t-168 88zm318 775q-8 2-16 2t-16 0h-32q-16 0-32-2v-47q-53 118-89 232t-59 230t-32 235t-10 248h128q0-121 8-234t27-223t49-219t74-222zm442 386h720q-20-57-56-104t-83-81t-104-52t-117-19q-61 0-117 18t-103 52t-84 81t-56 105z"
                    foot="ใช้ได้ถึง {{ $duedate->past_year_duedate->format('d-m-Y') }}"
                    color-sub="text-green-500 bg-green-100" color-foot="text-red-500 bg-red-100">
                </x-stat-card>
            @endif
            <x-stat-card title="ลากิจ"
                content="{{ $sumleave->prev_vecation_usage }} วัน"
                subcontent="เหลือ {{ $sumleave->prev_vecation_remain }} วัน"
                icon='<path fill="#000000" d="M22.505 15.503v7.002h-1v1H3.5v-1h-1v-7.002h7.002v2h6.001v-2z"/>
<path fill="#000000" d="M14.503 15.503h-4v1h4zm0-2h-4v1h4z"/><path fill="#000000" d="M22.505 5.5v-1h-6.002v-2h-1v-1H9.502v1h-1v2H2.5v1h-1v8.003h1v1h7.002v-2h6.001v2h7.002v-1h1V5.5zm-12.003-2h4.001v1h-4.001z"/>'
                foot="ใช้ได้ถึง {{ $duedate->past_year_duedate->format('d-m-Y') }}"
                color-sub="text-green-500 bg-green-100" color-foot="text-red-500 bg-red-100">
            </x-stat-card>
        </x-card-holder-xl4>
    </div>
</x-app-layout>
